#pragma once

// TODO 리스트

// 1. 아이템 데이터 시스템 만들기 
// - 아이템 정보 데이터 만들기 -完-
// - 아이템 클래스 만들기 (스태틱, 스켈레탈 메쉬 둘다) -完-

// 2. 아이템 자원 시스템 만들기 
// - 자원 정보 데이터 만들기 -完-
// - 자원 클래스 만들기 (스태틱, 스켈레탈 메쉬 둘다)  -完-

// 3. 인터렉트 컴포넌트 만들기  -完-
// - 표시 위젯 만들기  -完-
// - 표시 위젯 토글시키기 (아이템, 자원 둘다)  -完-
// - 인터렉트 라인 트레이스 디버그 만들기 -完-

// 4. 기본 플레이어 만들기
// - 카메라 움직임 -完-
// - 달리고, 걷고, 조깅 
// - wasd 움직임 -完-
// - 점프 

// 5. 상호작용하기
// - f 로 상호작용 키 
// - 자원의 경우 아이템 떨구기 테스트 -> 보류
// - 아이템의 경우 먹기 테스트
// 상호작용의 경우 SendGameplayEventToActor 로 클라, 호스트 전부 소통하게 하기
//
//
// 3. 상호작용 interact GA 완성하기
// 4. 자원에서 아이템 드롭 확인하기
// 5. 아이템 습득 GA 만들고 테스트하기